# Pandas:-

### Uses:-
    To read and manuplate Data

### Types of Data stucture:-
    1) Series:- 1d Data stucture
    2) DataFrame:- 2d Data Stucture(mostly used data stucture)
    3) Panel:- 3d Data Stucture

# Series Data stucture

It is 1 Dimensional Data stucture which contain Hetroginous data.
It have only one column.

### How to make series Data:
1st way-By list:

In [1]:
import pandas

In [2]:
list1=[2,3,4]
series1=pandas.Series(list1)
series1

0    2
1    3
2    4
dtype: int64

In [3]:
# how to give own index Name(Same like rowIndex in Excel)
list2=[10,20,30]
indexNumber=['a','b','c']
series2=pandas.Series(list2,index=indexNumber)
series2
# note:-Number of elements in indexNumber should be equal to Number of elements in list

a    10
b    20
c    30
dtype: int64

In [4]:
# how to give own dtype
list3=[100,200,300]
indexNumber3=['aa','bb','cc']
series3=pandas.Series(list3,index=indexNumber3,dtype='float')
series3
## to see the result Press cntl+enter

aa    100.0
bb    200.0
cc    300.0
dtype: float64

In [5]:
# How to give name of series
list4=[1000,2000,3000]
indexNumber4=['aaa','bbb','ccc']
series4=pandas.Series(list4,index=indexNumber4,dtype='float',name='abh')
series4
## to see the result Press cntl+enter

aaa    1000.0
bbb    2000.0
ccc    3000.0
Name: abh, dtype: float64

In [3]:
#2nd way to make series:-by dictionary
dict1={'a':1,'b':2}
series5=pandas.Series(dict1)
series5
#note:-to make series by dictonary key value become IndexNumber
## to see the result Press cntl+enter

a    1
b    2
dtype: int64

In [4]:
# If you want to give index number to your series, then key value of dictonary should macth with your index number.
#otherwise see below result
dict2={'a':1,'b':2}
series6=pandas.Series(dict2,index=['a','b'])
series6
## to see the result Press cntl+enter

a    1
b    2
dtype: int64

In [6]:
# If you want to give index number to your series, then key value of dictonary should macth with your index number.
dict2={'a':1,'b':2}
series7=pandas.Series(dict2,index=['x','y'])
series7

x   NaN
y   NaN
dtype: float64

### How to access value from series

In [8]:
# By slice oprator 
l8=[2,3,4]
s8=pandas.Series(l8)
s8[1]
#note:-In slice operator you mention the index number of corresponding element

3

### Methods of Series datatype

In [55]:
#you can performe mathmatical oprations on series
l9=[2,3,4]
s9=pandas.Series(l9)
l10=[3,4,5]
s10=pandas.Series(l10)
print(s9.max())
s9+s10

4

0    5
1    7
2    9
dtype: int64

# DataFrame Data Structure

It is 2 Dimensional Data stucture which contain Hetroginous data.
It have multiple columns(called labels) and multiple Row(call Index), just like in excel range(a1:d10)

## How to Create DataFrame
***

In [56]:
#1st way:- by list of list
l1=[[1,2,3],[10,20,30],[100,200,300]]
df1=pandas.DataFrame(l1)
df1

     0    1    2
0    1    2    3
1   10   20   30
2  100  200  300

In [68]:
# how to give index(called Row Number) and columns to DataFrame
l2=[[1,2,3],[10,20,30]]
df2=pandas.DataFrame(l2,index=['r1','r2'],columns=['c1','c2','c3'])
print(df2)
# note:-Here element in index should be equal to number of list inside parent list & number of elements in columns 
#should be equal to maximum number of elements inside any list of list.

l3=[[11,22,33],[111,222]]
df3=pandas.DataFrame(l3,index=['r1','r2'],columns=['c1','c2','c3'])
print(df3)

    c1  c2  c3
r1   1   2   3
r2  10  20  30
     c1   c2    c3
r1   11   22  33.0
r2  111  222   NaN

# Read CSV File

In [8]:
df=pandas.read_excel(r"C:\Users\DELL\Desktop\fz.xlsx")
df

,gender,race_ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group A,high school,standard,complete,93,91,69
1,female,group B,master's degree,free/reduced,complete,99,74,99
2,female,group B,associate's degree,standard,none,84,83,68
3,female,group B,some college,free/reduced,none,100,89,50
4,male,group B,associate's degree,standard,none,72,51,58
5,female,group B,some high school,standard,complete,68,57,99
6,male,group C,associate's degree,free/reduced,complete,53,94,56
7,female,group C,associate's degree,standard,complete,54,83,57
8,male,group B,some college,standard,none,56,95,50
9,male,group B,master's degree,standard,none,58,79,78
10,male,group C,associate's degree,standard,complete,94,85,63
11,female,group B,some college,standard,none,78,56,56
12,female,group A,high school,standard,complete,55,95,71
13,female,group A,associate's degree,standard,complete,95,75,57
14,male,group C,master's degree,free/reduced,complete,87,98,52
15,male,group C,master's degree,standard,none,71,50,58
16,male,group A,associate's degree,free/reduced,complete,54,57,61
17,male,group B,associate's degree,free/reduced,complete,67,61,92

In [9]:
#If you want to know size and shape of Data Frame
df.shape

(18, 8)

In [80]:
# if you want know full information of Dataframe like how many rows,coloumns,there dataype,null values
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, ab to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   B       3 non-null      object
 1   CC      3 non-null      object
 2   1       3 non-null      object
dtypes: object(3)
memory usage: 96.0+ bytes

In [81]:
df.describe()

         B   CC  1
count    3    3  3
unique   3    3  1
top     33  333  j
freq     1    1  3

In [82]:
df.dtypes

B     object
CC    object
1     object
dtype: object

In [12]:
# If you data fram is to big, then jupyter display only some data only. but if you want to show all data of your frame then
pandas.set_option('display.max_columns',4)

In [1]:
#If you want to make new data dataframe which contains only headings of your dataframe
# scema_df=pandas.read_csv(r"C:\Users\DELL\Desktop\Results_schema.csv")
# scema_df

NameError: name 'pandas' is not defined

In [86]:
# if you want to show particular numbers of rows from top of your dataframe
df.head(10)
# note:-if you not pass parameter in it, then defaulted it take 5

   Security Code Security Name  Company name Result Date
0       541988.0         AAVAS         391.0   29-Apr-21
1       500425.0     AMBUJACEM         207.0   29-Apr-21
2       532475.0       APTECHT         454.0   29-Apr-21
3       500215.0          ATFL         624.0   29-Apr-21
4       540611.0        AUBANK         232.0   29-Apr-21
5       532977.0    BAJAJ-AUTO         128.0   29-Apr-21
6       500490.0    BAJAJHLDNG         344.0   29-Apr-21
7       534758.0       CIGNITI         585.0   29-Apr-21
8       506395.0    COROMANDEL         123.0   29-Apr-21
9       542216.0     DALBHARAT         290.0   29-Apr-21

In [ ]:
# if you want to show particular numbers of rows of your rows from bottom of your dataframe
df.tail(7)
# note:-if you not pass parameter in it, then defaulted it take 5

## Access data value from DataFrame

In [16]:
d1={'a':1,'b':2}
d2={'a':11,'b':22}
d3={'a':[1,2,3],'b':[11,22,33],'c':[111,222,333]}
df2=pandas.DataFrame(d1,d2)
df1=pandas.DataFrame(d3)
# df1
df2

   a  b
a  1  2
b  1  2

In [208]:
# 1st way to access single column:-by (dictonary key/headings) value in slice oprator (This is recommended)
df1['a']

# type(df1['a'])
# this return series data not a dataFrame

0    1
1    2
2    3
Name: a, dtype: int64

In [92]:
#2nd way to access single column:-by dictonary key value as attribute
df1.a

0    1
1    2
Name: a, dtype: int64

In [18]:
# if you want to access multiple columns: by dictonary key/headings value in slice oprator in list
df1[['a','c']]
# This return a dataframe datatype because it has more than 1 column

   a    c
0  1  111
1  2  222
2  3  333

In [19]:
# if you want to know only headings or index of your dataframe
df1.columns

Index(['a', 'b', 'c'], dtype='object')

In [100]:
# if you want to access single rows: iloc ke parameter me row index pass kare
df1.iloc[1]

a      2
b     22
c    222
Name: 1, dtype: int64

In [102]:
# if you want to access multiple rows: iloc ke function m list ke ander multi row index pass kare
df1.iloc[[0,2]]

   a   b    c
0  1  11  111
2  3  33  333

In [103]:
# if you want to access multi rows with multi columns: iloc ke function m list ke ander multi row index or list ke ander multi column index pass kare
df1.iloc[[0,1],[1,2]]

# here 1st list parameter of row index and 2nd list for column index

    b    c
0  11  111
1  22  222

In [113]:
# Note:-if you want to use slice operator then you should pass slice operation without using square bracket lock or iloc methods
df1.iloc[1:,0:2]

   a   b
1  2  22
2  3  33

In [105]:
# iloc vs loc
# iloc:- isme hame parameter m row index or column index ki integer value pass krni hoti hai.(just like offset(1,1))
# loc:- isme hame parameter m row index ka name or column index ka name pass karana hota hai( just like range(d11)).
#     :- true value ko be return karta hai jiska use filter m bhot hota hai

   a  b
a  1  2
b  1  2

In [106]:
df2.iloc[1,1]

2

In [110]:
df2.loc['a','b']

2

In [120]:
df1.loc[1,'a':'c']

a      2
b     22
c    222
Name: 1, dtype: int64

In [126]:
# if you want set any particular coloumn as index(row name) of your dataframe:
df1.set_index('c')
df1

     a   b
c
111  1  11
222  2  22
333  3  33

In [142]:
df1.loc[111]

# note:-above code never gone be in action until you don't provided 2nd argument in set_index method that is inplace=ture

a     1
b    11
Name: 111, dtype: int64

In [146]:
df1.set_index('c',inplace=True)
df1
# Note:- by doing this so, column c is not be there b'coz it become a index of our dataframe
# if you now check the shapce of your data frame( by .shape property) there will be a 1 less column as original one
# Here you can check new index of you data frame (by .index property)
# inplace=true tell that you are ensure to whatever changes you do in current data will reflect the original data 
# you can also set index any column at time of reading dataFram (by index_col="name of column" parameter pass karake)

KeyError: "None of ['c'] are in the columns"

In [145]:
df1.loc[111,'b']

11

In [152]:
df1.shape

(3, 4)

In [193]:
df1.index

RangeIndex(start=0, stop=3, step=1)

In [151]:
# it set defult index as original one
df1.reset_index(inplace=True)
df1

   index    c  a   b
0      0  111  1  11
1      1  222  2  22
2      2  333  3  33

# Filter

In [13]:
import openpyxl

In [24]:
import openpyxl
df=pandas.read_excel(r"C:\Users\DELL\Desktop\kPython RND folder\Market_Watch_All.xlsx",sheet_name="All")
df

,Stokes,p(t),...,Unnamed: 42,URL
0,Mangalam Timber Prod,10.75,...,Mangalam Timber Prod,https://www.financialexpress.com/market/stock-...
1,Century Plyboards(I),344.00,...,Century Plyboards(I),https://www.financialexpress.com/market/stock-...
2,Greenply Industries,205.10,...,Greenply Industries,https://www.financialexpress.com/market/stock-...
3,Archidply Inds,33.50,...,Archidply Inds,https://www.financialexpress.com/market/stock-...
4,Greenpanel Inds.,233.80,...,Greenpanel Inds.,https://www.financialexpress.com/market/stock-...
...,...,...,...,...,...
96,GTN Textiles,5.60,...,GTN Textiles,https://www.financialexpress.com/market/stock-...
97,Super Spinning Mills,6.00,...,Super Spinning Mills,https://www.financialexpress.com/market/stock-...
98,Sumeet Inds,4.40,...,Sumeet Inds,https://www.financialexpress.com/market/stock-...
99,DCM,26.75,...,DCM,https://www.financialexpress.com/market/stock-...
100,Sarla Perform. Fibre,31.50,...,Sarla Perform. Fibre,https://www.financialexpress.com/market/stock-...

In [25]:
# for i in df.columns:
#     print(i)
df.columns

Index(['Stokes', 'p(t)', 'P(t+1)', 'P(t+2)', 'P(t+3)', 'p(t+4)', '%(t)',
       '%(t+1)', '%(t+2)', '%(t+3)', '%(t+4)', 'v(t)', 'v(t+1)', 'v(t+2)',
       'v(t+3)', 'v(t+4)', 'del(t)', 'del(t+1)', 'del(t+2)', 'del(t+3)',
       'del(t+4)', 'Sector', 'Market Cap (Rs. in Cr.) ',
       'Earning Per Share (EPS TTM) (Rs.)', 'Price To Earnings (P/E) Ratio',
       'Book Value Per Share (Rs.)', 'Price/Book (MRQ)', 'Price/Earning (TTM)',
       'ROCE (%)', 'PAT Margin', 'Dividend Yield', 'Face Value',
       'Non-Institution', 'Promoters', 'Fi/Banks/Insurance',
       'Mutual Funds/Uti', 'Government', 'FII', 'Industry', 'Unnamed: 39',
       'Unnamed: 40', 'Unnamed: 41', 'Unnamed: 42', 'URL'],
      dtype='object')

In [8]:
arr=df.to_numpy()
arr
arr[0]

array(['Mangalam Timber Prod', 10.75, 10.75, 10.3, 10.15, 10.3, 4.37,
       4.37, -0.48, -1.46, -0.48, 15.39, 15.39, 5.56, 5.36, 2.64, 99.03,
       99.03, nan, nan, nan, 'Wood & Wood Products', 19.04, -9.94, 0.0,
       -39.13, -0.27, -1.14, -23.62, -368.22, 0.0, 10, 62.52, 37.46, 0.0,
       0.0, 0.0, 0, nan, nan, nan, nan, 'Mangalam Timber Prod',
       'https://www.financialexpress.com/market/stock-market/mangalam-timber-products-ltd-stock-price/'],
      dtype=object)

## Filter

In [26]:
#filter data according to one condition

filt=(df['Stokes']== 'DCM')
df.loc[filt]

#2nd way
df[df['Stokes']== 'DCM']

,Stokes,p(t),...,Unnamed: 42,URL
99,DCM,26.75,...,DCM,https://www.financialexpress.com/market/stock-...

In [28]:
# filter data according to multiple condition with (&-->represent 'and' condition) (|-->represend 'or' condition)

filt=(df['Stokes']== 'DCM') | (df['Stokes']== 'Sumeet Inds')
df.loc[filt]

# 2nd way
df[filt]

,Stokes,p(t),...,Unnamed: 42,URL
98,Sumeet Inds,4.40,...,Sumeet Inds,https://www.financialexpress.com/market/stock-...
99,DCM,26.75,...,DCM,https://www.financialexpress.com/market/stock-...

In [44]:
# filter data which is oppsitive to multiple condition (&-->represent 'and' condition) (|-->represend 'or' condition): Provide (-)minus to final condition
# Ex-1
filt=(df['Stokes']== 'DCM') | (df['Stokes']== 'Sumeet Inds')
df.loc[-(filt)]

,Stokes,p(t),P(t+1),P(t+2),P(t+3),p(t+4),%(t),%(t+1),%(t+2),%(t+3),...,Fi/Banks/Insurance,Mutual Funds/Uti,Government,FII,Industry,Unnamed: 39,Unnamed: 40,Unnamed: 41,Unnamed: 42,URL
0,Mangalam Timber Prod,10.75,10.75,10.30,10.15,10.30,4.37,4.37,-0.48,-1.46,...,0.0,0.00,0.0,0,NaN,NaN,NaN,NaN,Mangalam Timber Prod,https://www.financialexpress.com/market/stock-...
1,Century Plyboards(I),344.00,344.00,347.70,361.10,366.85,-1.06,-1.06,-0.52,-1.57,...,0.0,10.65,0.0,0,NaN,NaN,NaN,NaN,Century Plyboards(I),https://www.financialexpress.com/market/stock-...
2,Greenply Industries,205.10,205.10,200.75,205.90,205.50,2.17,2.17,-0.57,0.19,...,0.0,27.25,0.0,0,NaN,NaN,NaN,NaN,Greenply Industries,https://www.financialexpress.com/market/stock-...
3,Archidply Inds,33.50,33.50,34.10,34.75,35.15,-1.76,-1.76,-0.87,-1.14,...,0.0,0.00,0.0,0,NaN,NaN,NaN,NaN,Archidply Inds,https://www.financialexpress.com/market/stock-...
4,Greenpanel Inds.,233.80,233.80,231.75,230.00,224.30,0.88,0.88,-1.15,2.54,...,0.0,0.00,0.0,0,NaN,NaN,NaN,NaN,Greenpanel Inds.,https://www.financialexpress.com/market/stock-...
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
94,Ginni Filaments,27.65,27.65,27.40,26.90,22.45,0.91,0.91,-1.97,19.82,...,0.0,0.00,0.0,0,NaN,NaN,NaN,NaN,Ginni Filaments,https://www.financialexpress.com/market/stock-...
95,Lambodhara Textiles,60.15,60.15,58.80,58.40,55.10,2.30,2.30,-2.65,5.99,...,0.0,0.00,0.0,0,NaN,NaN,NaN,NaN,Lambodhara Textiles,https://www.financialexpress.com/market/stock-...
96,GTN Textiles,5.60,5.60,5.45,5.45,5.55,2.75,2.75,-4.39,-1.80,...,0.0,0.00,0.0,0,NaN,NaN,NaN,NaN,GTN Textiles,https://www.financialexpress.com/market/stock-...
97,Super Spinning Mills,6.00,6.00,6.20,6.20,5.65,-3.23,-3.23,-4.62,9.73,...,0.0,0.00,0.0,0,NaN,NaN,NaN,NaN,Super Spinning Mills,https://www.financialexpress.com/market/stock-...
100,Sarla Perform. Fibre,31.50,31.50,31.30,29.75,30.30,0.64,0.64,5.74,-1.82,...,0.0,0.00,0.0,0,NaN,NaN,NaN,NaN,Sarla Perform. Fibre,https://www.financialexpress.com/market/stock-...

In [45]:
# filter data which is oppsitive to multiple condition (&-->represent 'and' condition) (|-->represend 'or' condition): Provide (-)minus to final condition
# Ex-2
filt=(df['Stokes']== 'DCM') | (df['Stokes']== 'Sumeet Inds')
df.loc[-(filt),'URL']

0      https://www.financialexpress.com/market/stock-...
1      https://www.financialexpress.com/market/stock-...
2      https://www.financialexpress.com/market/stock-...
3      https://www.financialexpress.com/market/stock-...
4      https://www.financialexpress.com/market/stock-...
                             ...
94     https://www.financialexpress.com/market/stock-...
95     https://www.financialexpress.com/market/stock-...
96     https://www.financialexpress.com/market/stock-...
97     https://www.financialexpress.com/market/stock-...
100    https://www.financialexpress.com/market/stock-...
Name: URL, Length: 99, dtype: object

In [ ]:
#greater salary >7000    by isin method  (eg--> f=df['a'].isin['kakk','guddu'])
# find special country data bt str.contens(eg-->  f=df['a'].str.contens['vijay','kakkry']

In [39]:
df['Stokes'].apply(len)

0      20
1      20
2      19
3      14
4      16
       ..
96     12
97     20
98     11
99      3
100    20
Name: Stokes, Length: 101, dtype: int64

# Update & modifying row & columns & data value

In [42]:
d3={'a':[1,2,3],'b':[11,22,33],'c':[111,222,333]}
df=pandas.DataFrame(d3)
df

   a   b    c
0  1  11  111
1  2  22  222
2  3  33  333

In [61]:
#get row index or columns index of dataframe
col_x=df.columns
row_x=df.index
print(col_x,row_x)

Index(['a', 'b', 'CC'], dtype='object') Int64Index([11, 22, 33], dtype='int64')

In [54]:
#Rename columns index, number of columns should equal to original dataframe no. of columns
# df.columns=['aa','bb','cc']
df.columns=['aa','bb','cc']
df

   aa  bb   cc
0   1  11  111
1   2  22  222
2   3  33  333

In [59]:
#Rename row_index
df.index=[11,22,33]

Int64Index([11, 22, 33], dtype='int64')

In [69]:
#Set particular columns as index
df.set_index("a",inplace=True)

KeyError: "None of ['a'] are in the columns"

In [70]:
#Set original index number
df.reset_index()
df

    B   CC
a
1  11  111
2  22  222
3  33  333

In [79]:
# rename particular raw index
df.rename(index={1:'ab',2:'cd'},inplace=True)
df

     B   CC  1
a
ab   j    j  j
cd  22  222  j
3   33  333  j

In [ ]:
# add new row to df

In [65]:
#Rename all columns index name as upper case: by using list comprehension
df.columns=[x.upper() for x in df.columns]
df.columns

Index(['B', 'CC'], dtype='object')

In [56]:
#Rename particular columns index name 
df.rename(columns={'AA':'a','BB':'b'},inplace=True)
df

   a   b   CC
0  1  11  111
1  2  22  222
2  3  33  333

In [303]:
#Update and modify any data
#first we access that data which we want to update, end assign value to it by pressing equal to
#loc and iloc method is best for accessing the data

   a   b    c
0  1  11  111
1  2  22  222
2  3  33  333

In [305]:
df.loc[1,'a']=10
df

2

In [302]:
df.loc[[1,2],'a']=20
df

TypeError: 'slice(None, None, None)' is an invalid key

In [306]:
df.loc[[1,2],'a']=[30,40]
df

    a   b    c
0   1  11  111
1  30  22  222
2  40  33  333

In [320]:
#If you want to change data according value, it can be possible by filter
filt=(df['a']==2)
df.loc[filt,'c']=500
df

     a   b    c
0  100   2  100
1    2   2  500
2   40  33  333

In [316]:
df.loc[1,:]=2
df

     a   b    c
0  100   2  100
1    2   2    2
2   40  33  333